In [2]:
import pandas as pd
import numpy as np

In [52]:
df1 = pd.read_excel("C:/Users/defaultuser0/Desktop/Sneha_thesis/excel_files/Cor_Coupon_Dates/Austria.xlsx")
df2 = pd.read_excel("C:/Users/defaultuser0/Desktop/Sneha_thesis/excel_files/Cor_Coupon_Dates/Belgium.xlsx")
#df3 = pd.read_excel("C:/Users/defaultuser0/Desktop/Sneha_thesis/excel_files/Cor_Coupon_Dates/Croatia.xlsx")
#df4 = pd.read_excel("C:/Users/defaultuser0/Desktop/Sneha_thesis/excel_files/Cor_Coupon_Dates/Cyprus.xlsx")
#df5 = pd.read_excel("C:/Users/defaultuser0/Desktop/Sneha_thesis/excel_files/Cor_Coupon_Dates/Estonia.xlsx")

df6 = pd.read_excel("C:/Users/defaultuser0/Desktop/Sneha_thesis/excel_files/Cor_Coupon_Dates/Finland.xlsx")
df7 = pd.read_excel("C:/Users/defaultuser0/Desktop/Sneha_thesis/excel_files/Cor_Coupon_Dates/France.xlsx")
df8 = pd.read_excel("C:/Users/defaultuser0/Desktop/Sneha_thesis/excel_files/Cor_Coupon_Dates/Germany.xlsx")
df9 = pd.read_excel("C:/Users/defaultuser0/Desktop/Sneha_thesis/excel_files/Cor_Coupon_Dates/Greece.xlsx")
df10 = pd.read_excel("C:/Users/defaultuser0/Desktop/Sneha_thesis/excel_files/Cor_Coupon_Dates/Ireland.xlsx")

df11 = pd.read_excel("C:/Users/defaultuser0/Desktop/Sneha_thesis/excel_files/Cor_Coupon_Dates/Italy.xlsx")
df12 = pd.read_excel("C:/Users/defaultuser0/Desktop/Sneha_thesis/excel_files/Cor_Coupon_Dates/Latvia.xlsx")
#df13 = pd.read_excel("C:/Users/defaultuser0/Desktop/Sneha_thesis/excel_files/Cor_Coupon_Dates/Lithuania.xlsx")
#df14 = pd.read_excel("C:/Users/defaultuser0/Desktop/Sneha_thesis/excel_files/Cor_Coupon_Dates/Luxembourg.xlsx")
#df15 = pd.read_excel("C:/Users/defaultuser0/Desktop/Sneha_thesis/excel_files/Cor_Coupon_Dates/Malta.xlsx")

df16 = pd.read_excel("C:/Users/defaultuser0/Desktop/Sneha_thesis/excel_files/Cor_Coupon_Dates/Netherlands.xlsx")
df17 = pd.read_excel("C:/Users/defaultuser0/Desktop/Sneha_thesis/excel_files/Cor_Coupon_Dates/Portugal.xlsx")
#df18 = pd.read_excel("C:/Users/defaultuser0/Desktop/Sneha_thesis/excel_files/Cor_Coupon_Dates/Slovakia.xlsx")
#df19 = pd.read_excel("C:/Users/defaultuser0/Desktop/Sneha_thesis/excel_files/Cor_Coupon_Dates/Slovenia.xlsx")
df20 = pd.read_excel("C:/Users/defaultuser0/Desktop/Sneha_thesis/excel_files/Cor_Coupon_Dates/Spain.xlsx")

In [51]:
df2 = df2.iloc[:, 1:]

df6 = df6.iloc[:, 1:]

df7 = df7.iloc[:, 1:]
df8 = df8.iloc[:, 1:]
df9 = df9.iloc[:, 1:]
df10 = df10.iloc[:, 1:]
df11 = df11.iloc[:, 1:]

df12 = df12.iloc[:, 1:]


df16 = df16.iloc[:, 1:]

df17 = df17.iloc[:, 1:]

df20 = df20.iloc[:, 1:]

In [53]:
dfs = [df1, df2, df6, df7, df8, df9, df10, df11, df12, df16, df17,  df20]

# Use pd.concat to merge them side by side (along the columns)
df = pd.concat(dfs, axis=1)

In [55]:
df.to_excel(f"C:/Users/defaultuser0/Desktop/Sneha_thesis/excel_files/All Euro/Corporate/Coupon_Dates.xlsx", index = False)

In [57]:
df20

   8019EA   224R2D   2497Y2   225CVC  661FRQ
0   41376  43753.0  43936.0  43748.0   44699
1   42106  44484.0  44666.0  44479.0   45430
2   42837  45214.0  45397.0  45209.0   46160
3   43567  45945.0  46127.0  45940.0   46891
4   44298  46310.0  46310.0  46305.0   47621
5   44663  46492.0  46492.0  46487.0   47986
6   44846      NaN      NaN      NaN   48170